src/main/java/ru/vk/itmo/test/andreycheshev/lab2/wrk2-results/flush_gap/5mb
[andrey@archlinux wrk2]$ ./wrk -d 40 -t 1 -c 64 -s /home/andrey/andrey/scripts/put.lua -L -R 15000 http://localhost:8080/v0/entity/
Running 40s test @ http://localhost:8080/v0/entity/
  1 threads and 64 connections
  Thread calibration: mean lat.: 26.236ms, rate sampling interval: 176ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.90ms   15.83ms 153.98ms   89.54%
    Req/Sec    15.04k     1.42k   20.28k    80.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.81ms
 75.000%   15.11ms
 90.000%   29.61ms
 99.000%   82.50ms
 99.900%  123.26ms
 99.990%  143.23ms
 99.999%  151.04ms
100.000%  154.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.080     0.000000            1         1.00
       1.809     0.100000        44514         1.11
       3.115     0.200000        89026         1.25
       4.523     0.300000       133569         1.43
       6.043     0.400000       178090         1.67
       7.807     0.500000       222576         2.00
       8.831     0.550000       244889         2.22
       9.999     0.600000       267088         2.50
      11.359     0.650000       289336         2.86
      12.991     0.700000       311527         3.33
      15.111     0.750000       333797         4.00
      16.431     0.775000       344974         4.44
      17.967     0.800000       356012         5.00
      19.951     0.825000       367174         5.71
      22.415     0.850000       378265         6.67
      25.535     0.875000       389409         8.00
      27.391     0.887500       394962         8.89
      29.615     0.900000       400526        10.00
      32.143     0.912500       406105        11.43
      34.975     0.925000       411667        13.33
      38.527     0.937500       417232        16.00
      40.735     0.943750       419980        17.78
      43.167     0.950000       422774        20.00
      46.111     0.956250       425566        22.86
      49.823     0.962500       428332        26.67
      54.335     0.968750       431112        32.00
      57.055     0.971875       432498        35.56
      60.351     0.975000       433895        40.00
      63.967     0.978125       435281        45.71
      68.159     0.981250       436689        53.33
      72.703     0.984375       438059        64.00
      75.199     0.985938       438767        71.11
      77.823     0.987500       439461        80.00
      80.767     0.989062       440149        91.43
      83.903     0.990625       440848       106.67
      87.999     0.992188       441540       128.00
      90.559     0.992969       441883       142.22
      93.503     0.993750       442235       160.00
      97.023     0.994531       442580       182.86
     101.183     0.995313       442926       213.33
     105.215     0.996094       443274       256.00
     107.263     0.996484       443448       284.44
     109.887     0.996875       443622       320.00
     112.447     0.997266       443796       365.71
     114.943     0.997656       443972       426.67
     117.183     0.998047       444142       512.00
     118.655     0.998242       444233       568.89
     119.743     0.998437       444316       640.00
     120.895     0.998633       444409       731.43
     122.239     0.998828       444490       853.33
     123.391     0.999023       444580      1024.00
     124.287     0.999121       444624      1137.78
     124.991     0.999219       444665      1280.00
     126.015     0.999316       444707      1462.86
     127.103     0.999414       444751      1706.67
     128.895     0.999512       444794      2048.00
     130.303     0.999561       444816      2275.56
     131.327     0.999609       444840      2560.00
     133.375     0.999658       444861      2925.71
     135.039     0.999707       444883      3413.33
     136.959     0.999756       444903      4096.00
     138.239     0.999780       444915      4551.11
     139.007     0.999805       444925      5120.00
     139.775     0.999829       444935      5851.43
     140.799     0.999854       444946      6826.67
     142.591     0.999878       444960      8192.00
     142.975     0.999890       444963      9102.22
     143.359     0.999902       444969     10240.00
     143.615     0.999915       444973     11702.86
     144.767     0.999927       444980     13653.33
     145.791     0.999939       444984     16384.00
     146.303     0.999945       444988     18204.44
     146.431     0.999951       444990     20480.00
     146.943     0.999957       444992     23405.71
     147.071     0.999963       444995     27306.67
     147.583     0.999969       444998     32768.00
     147.839     0.999973       445000     36408.89
     149.247     0.999976       445001     40960.00
     149.759     0.999979       445002     46811.43
     150.143     0.999982       445003     54613.33
     150.399     0.999985       445005     65536.00
     150.399     0.999986       445005     72817.78
     150.911     0.999988       445006     81920.00
     151.039     0.999989       445007     93622.86
     151.039     0.999991       445007    109226.67
     152.703     0.999992       445008    131072.00
     152.703     0.999993       445008    145635.56
     152.831     0.999994       445009    163840.00
     152.831     0.999995       445009    187245.71
     152.831     0.999995       445009    218453.33
     153.087     0.999996       445010    262144.00
     153.087     0.999997       445010    291271.11
     153.087     0.999997       445010    327680.00
     153.087     0.999997       445010    374491.43
     153.087     0.999998       445010    436906.67
     154.111     0.999998       445011    524288.00
     154.111     1.000000       445011          inf
#[Mean    =       12.899, StdDeviation   =       15.827]
#[Max     =      153.984, Total count    =       445011]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597283 requests in 40.00s, 38.16MB read
Requests/sec:  14931.72
Transfer/sec:      0.95MB